Web/app/Models/Account.php

SELECT *
FROM `account`
WHERE `email` = 'nekszer@gmail.com'
 LIMIT 1
---
    public function signIn($email, $password, $response, $error) : string {
        $account = $this->where('email', $email)->first();