Web/app/Models/Calendarmember.php

    public function sendInvitation($email, $calendarId) : array {
        $accountModel = new Account();
        $accountId = $accountModel->getAccountIdByEmail($email);
        if($accountId < 1){
            return [
                "status" => false,
                "message" => "No encontramos la cuenta del email"
            ];
        }

        $countInvitationForCalendar = $this->db->query("SELECT * FROM $this->table WHERE calendarId = $calendarId AND accountId = $accountId")->getNumRows();
        if($countInvitationForCalendar > 0){
            return [
                "status" => true,
                "message" => "Ya se ha invitado al usuario a este calendario"
            ];
        }

        $notificationManager = new \App\Notifications\NotificationManager();
        $notificationManager->notify($accountId, "Shared Calendar - Invitación", "Te han invitado a un calendario, accede a tu aplicación para aceptar la invitación");

        $insertId = $this->insert([
            "accountId" => $accountId,
            "calendarId" => $calendarId,
            "status" => "pending"
        ]);
---
INSERT INTO `calendarmember` (`accountId`, `calendarId`, `status`) VALUES ('2', '1', 'pending')