Web/app/Models/Token.php

INSERT INTO `token` (`accountId`, `token`, `expires`) VALUES ('2', 'a4fba6f7a2bdd53c9280fa5afd4e02af', '2022-07-30 15:14:25')
---
    public function makeAuthorization($email) {
        $account = (object) $this->db->query("SELECT * FROM account WHERE email = '$email'")->getRow();
        $accountId = $account->id;
        $rand_token = openssl_random_pseudo_bytes(16);
        $token = bin2hex($rand_token);
        $datetime = date('Y-m-d H:i:s', strtotime("+30 day"));
        $insertId = $this->insert([
            "accountId" => $accountId,
            "token" => $token,
            "expires" => $datetime
        ]);

SELECT *
FROM `token`
WHERE `token` = '8b6408b5aea32301357a887f296d72f0'
---
    public function isValidToken($token) : bool {
        if(empty($token))
            return false;
        $tokenData = $this->where('token', $token)->findAll()[0];