app/Controllers/Api.php

    private function hasAuthorization($headers) {
        $token = "";
        foreach ($headers as $key => $value) {
            if($key == 'X-Token'){
                $token = str_replace('X-Token: ', '', $value);
                break;
            }
        }

        $tokenModel = new \App\Models\Token();
        $isValidToken = $tokenModel->isValidToken($token);

        if($isValidToken){
            $tokenData = $tokenModel->where('token', $token)->findAll()[0];
---
SELECT *
FROM `token`
WHERE `token` = 'a4fba6f7a2bdd53c9280fa5afd4e02af'