app/Controllers/Utils.php

    public function download($id) {
        $receipModel = new \App\Models\Receipt();
        $receipt = $receipModel->find($id);
---
SELECT *
FROM `receipt`
WHERE `receipt`.`id` = '2'