app/Models/Events.php

INSERT INTO `events` (`id`, `name`, `description`, `day`, `allDay`, `start`, `end`, `hasLocation`, `latitude`, `longitude`, `calendarId`, `accountId`) VALUES (NULL, 'Evento de prueba', 'Evento de prueba con texto largo para la demostracion de lafuncion', '2022-07-12', 'Y', '2022-07-15 23:01:28', '2022-07-15 23:01:28', 'N', 0, 0, '1', '2')
---
    public function addEvent(Event $event) : bool {
        $calendarId = $event->calendarId;
        $accountId = $event->accountId;
        $calendarModel = new Calendar();
        if($calendarModel->isOwner($calendarId, $accountId)){
            $id = $this->insert($event);